# FilteredWorksetIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilteredWorksetIterator Methods
FilteredWorksetIterator Class See Also
---
The FilteredWorksetIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetCurrent | The current workset found by the iterator. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsDone | Identifies if the iteration has completed. |
| MoveNext | Increments the iterator to the next workset passing the filter. |
| Reset | Resets the iterator to the beginning. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
FilteredWorksetIterator Class
Autodesk.Revit.DB Namespace